Repository: bounthongv/task-reminder
Catalog: lib/l10n/app_*.arb
Languages: lo

# appTitle
source: Task Reminder
lo: ເຕືອນຄວາມຈຳກ່ຽວກັບວຽກ

# welcomeMessage
source: Welcome to Task Reminder
lo: ຍິນດີຕ້ອນຮັບສູ່ເຕືອນຄວາມຈຳກ່ຽວກັບວຽກ

source: Login
lo: ເຂົ້າສູ່ລະບົບ

source: Register
lo: ລົງທະບຽນ

source: Email
lo: ອີເມລ

source: Password
lo: ລະຫັດຜ່ານ

source: Sign in with Google
lo: ເຂົ້າສູ່ລະບົບດ້ວຍ Google

# signInWithGooglePrompt
source: You can also sign in or create a new account with Google:
lo: ທ່ານຍັງສາມາດເຂົ້າສູ່ລະບົບ ຫຼື ສ້າງບັນຊີໃໝ່ດ້ວຍ Google:

source: Theme
lo: ຮູບແບບ

source: Language
lo: ພາສາ

source: Logout
lo: ອອກຈາກລະບົບ

source: Test Notification
lo: ທົດສອບການແຈ້ງເຕືອນ

source: Download Tasks
lo: ດາວໂຫຼດວຽກ

source: Test Firestore
lo: ທົດສອບ Firestore

source: Add Task
lo: ເພີ່ມວຽກ

# addNewTask
source: Add a New Task
lo: ເພີ່ມວຽກໃໝ່

source: Task Title
lo: ຊື່ວຽກ

# dueDateFormat
source: Due Date (YYYY-MM-DD HH:MM)
lo: ວັນທີ່ຄົບກຳນົດ (YYYY-MM-DD HH:MM)

source: Description
lo: ລາຍລະອຽດ

source: Repeat Task
lo: ວຽກທີ່ຕ້ອງເຮັດຊ້ຳ

# repeatEvery
source: Repeat Every (number)
lo: ຊ້ຳທຸກໆ (ຕົວເລກ)

source: Repeats every
lo: ຊ້ຳທຸກໆ

source: Your Tasks
lo: ວຽກຂອງທ່ານ

source: No tasks available.
lo: ບໍ່ມີວຽກທີ່ສາມາດໃຊ້ໄດ້.

source: Error
lo: ຂໍ້ຜິດພາດ

source: Due
lo: ຄົບກຳນົດ

source: Sort by
lo: ຈັດລຽງຕາມ

source: Filter
lo: ກັ່ນຕອງ

# sortDueDate
source: Due Date
lo: ວັນທີ່ຄົບກຳນົດ

# sortStatus
source: Status
lo: ສະຖານະ

# sortTitle
source: Title
lo: ຊື່

# filterAll
source: All
lo: ທັງໝົດ

# filterPending
source: Pending
lo: ລໍຖ້າ

# filterOverdue
source: Overdue
lo: ເກີນຄົບກຳນົດ

# filterCompleted
source: Completed
lo: ສຳເລັດ

# repeatMinutes
source: Minutes
lo: ນາທີ

# repeatHours
source: Hours
lo: ຊົ່ວໂມງ

# repeatDays
source: Days
lo: ມື້

source: Task added successfully
lo: ເພີ່ມວຽກສຳເລັດແລ້ວ

# failedToAddTask
source: Failed to add task. Please try again.
lo: ບໍ່ສາມາດເພີ່ມວຽກໄດ້. ກະລຸນາລອງໃໝ່.

source: Task updated successfully
lo: ອັບເດດວຽກສຳເລັດແລ້ວ

# failedToUpdateTask
source: Failed to update task. Please try again.
lo: ບໍ່ສາມາດອັບເດດວຽກໄດ້. ກະລຸນາລອງໃໝ່.

source: Task deleted successfully
lo: ລຶບວຽກສຳເລັດແລ້ວ

# failedToDeleteTask
source: Failed to delete task. Please try again.
lo: ບໍ່ສາມາດລຶບວຽກໄດ້. ກະລຸນາລອງໃໝ່.

source: Task Overdue
lo: ວຽກເກີນຄົບກຳນົດ

source: Reminder
lo: ເຕືອນຄວາມຈຳ

source: Dismiss
lo: ປິດ

# tasksDownloaded
source: Tasks downloaded as tasks.json
lo: ດາວໂຫຼດວຽກເປັນ tasks.json ແລ້ວ

# downloadWebOnly
source: Download is only available on web
lo: ການດາວໂຫຼດສາມາດໃຊ້ໄດ້ສະເພາະໃນເວັບເທົ່ານັ້ນ

# invalidDateFormat
source: Invalid date format! Use YYYY-MM-DD HH:MM
lo: ຮູບແບບວັນທີ່ບໍ່ຖືກຕ້ອງ! ໃຊ້ YYYY-MM-DD HH:MM

source: Edit Task
lo: ແກ້ໄຂວຽກ

source: Update
lo: ອັບເດດ

source: Cancel
lo: ຍົກເລີກ

source: Delete Task
lo: ລຶບວຽກ

# confirmDeleteTask
source: Are you sure you want to delete '{taskTitle}'?
lo: ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລຶບ '{taskTitle}'?

source: Delete
lo: ລຶບ

# testDocumentWritten
source: Test document written to Firestore
lo: ຂຽນເອກະສານທົດສອບໃສ່ Firestore ແລ້ວ

# errorWritingTestDocument
source: Error writing test document: {error}
lo: ຂໍ້ຜິດພາດໃນການຂຽນເອກະສານທົດສອບ: {error}

source: Sign Out
lo: ອອກຈາກລະບົບ

# confirmSignOut
source: Are you sure you want to sign out?
lo: ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການອອກຈາກລະບົບ?

# failedToSignOut
source: Failed to sign out. Please try again.
lo: ບໍ່ສາມາດອອກຈາກລະບົບໄດ້. ກະລຸນາລອງໃໝ່.

# accountExistsError
source: An account with this email already exists. Please log in or link your account.
lo: ບັນຊີທີ່ໃຊ້ອີເມວນີ້ມີຢູ່ແລ້ວ. ກະລຸນາເຂົ້າສູ່ລະບົບ ຫຼື ເຊື່ອມໂຍງບັນຊີຂອງທ່ານ.

source: Filter by
lo: ກັ່ນຕອງຕາມ

source: Task upcoming
lo: ວຽກທີ່ຈະມາເຖິງ

source: Failed to check tasks
lo: ການກວດສອບວຽກລົ້ມເຫຼວ

# systemTheme
source: System
lo: ລະບົບ

# brightTheme
source: Bright
lo: ສົດໃສ

# darkTheme
source: Dark
lo: ມືດ

# oceanTheme
source: Ocean
lo: ມະຫາສະໝຸດ

# forestTheme
source: Forest
lo: ປ່າໄມ້

# sunsetTheme
source: Sunset
lo: ຕາເວັນຕົກ

# loginButton
source: Login
lo: ເຂົ້າສູ່ລະບົບ

# sortByDueDate
source: Due Date
lo: ວັນທີໝົດກຳນົດ

# sortByStatus
source: Status
lo: ສະຖານະ

# sortByTitle
source: Title
lo: ຫົວຂໍ້

source: Forgot Password?
lo: ລືມລະຫັດຜ່ານ?

source: Reset Password
lo: ຕັ້ງຄ່າລະຫັດຜ່ານໃໝ່

# enterEmailToReset
source: Enter your email to reset password
lo: ໃສ່ອີເມວຂອງທ່ານເພື່ອຕັ້ງຄ່າລະຫັດຜ່ານໃໝ່

# resetPasswordEmailSent
source: Password reset email sent
lo: ສົ່ງອີເມວຕັ້ງຄ່າລະຫັດຜ່ານແລ້ວ

source: Send Reset Link
lo: ສົ່ງລິ້ງຕັ້ງຄ່າໃໝ່

# failedToSendResetEmail
source: Failed to send reset email. Please check your email address.
lo: ບໍ່ສາມາດສົ່ງອີເມວຕັ້ງຄ່າໃໝ່ໄດ້. ກະລຸນາກວດສອບອີເມວຂອງທ່ານ.

# emailRequired
source: Email is required
lo: ຕ້ອງການອີເມວ

# invalidEmailFormat
source: Please enter a valid email address
lo: ກະລຸນາໃສ່ທີ່ຢູ່ອີເມວທີ່ຖືກຕ້ອງ

# emailAlreadyExists
source: This email is already registered in our system
lo: ອີເມວນີ້ຖືກລົງທະບຽນໃນລະບົບຂອງພວກເຮົາແລ້ວ

# emailAlreadyInUse
source: This email is already in use
lo: ອີເມວນີ້ຖືກນຳໃຊ້ແລ້ວ

# weakPassword
source: Password is too weak. Please use a stronger password
lo: ລະຫັດຜ່ານອ່ອນແອເກີນໄປ. ກະລຸນາໃຊ້ລະຫັດຜ່ານທີ່ຮັດແຮງກ່ວາ

# invalidEmail
source: Please enter a valid email address
lo: ກະລຸນາໃສ່ທີ່ຢູ່ອີເມວທີ່ຖືກຕ້ອງ

# registrationError
source: Registration failed. Please try again
lo: ການລົງທະບຽນລົ້ມເຫຼວ. ກະລຸນາລອງໃໝ່

# userNotFound
source: No account found with this email. Please check your email or register a new account.
lo: ບໍ່ພົບບັນຊີທີ່ໃຊ້ອີເມວນີ້. ກະລຸນາກວດສອບອີເມວຂອງທ່ານ ຫຼື ລົງທະບຽນບັນຊີໃໝ່.

# wrongPassword
source: Incorrect password. Please try again.
lo: ລະຫັດຜ່ານບໍ່ຖືກຕ້ອງ. ກະລຸນາລອງໃໝ່.

# userDisabled
source: This account has been disabled. Please contact support.
lo: ບັນຊີນີ້ຖືກປິດໃຊ້ງານ. ກະລຸນາຕິດຕໍ່ຫາຝ່າຍບໍລິການລູກຄ້າ.

# noAccount
source: Don't have an account?
lo: ຍັງບໍ່ທັນມີບັນຊີບໍ?

# alreadyHaveAccount
source: Already have an account?
lo: ມີບັນຊີຢູ່ແລ້ວບໍ?

source: Register with Google
lo: ລົງທະບຽນດ້ວຍ Google

source: Notification Sound
lo: ສຽງແຈ້ງເຕືອນ

# soundDefault
source: Default
lo: ຄ່າເລີ່ມຕົ້ນ

# soundChime
source: Chime
lo: ສຽງກະດິ່ງ

# soundBeep
source: Beep
lo: ສຽງບີບ
